interface AddOptions {
  kind: string[];
  value: string[];
}

export const ADD_OPTIONS_150_EQUIPMENT: AddOptions[] = [
  {
    kind: ["STR", "DEX", "INT", "LUK"],
    value: [
      "---",
      "+24 (3등급)",
      "+32 (4등급)",
      "+40 (5등급)",
      "+48 (6등급)",
      "+56 (7등급)",
    ],
  },
  {
    kind: [
      "STR + DEX",
      "STR + INT",
      "STR + LUK",
      "DEX + INT",
      "DEX + LUK",
      "INT + LUK",
    ],
    value: [
      "---",
      "+12 (3등급)",
      "+16 (4등급)",
      "+20 (5등급)",
      "+24 (6등급)",
      "+28 (7등급)",
    ],
  },
  {
    kind: ["최대 HP", "최대 MP"],
    value: [
      "---",
      "+1350 (3등급)",
      "+1800 (4등급)",
      "+2250 (5등급)",
      "+2700 (6등급)",
      "+3150 (7등급)",
    ],
  },
  {
    kind: ["공격력", "마력"],
    value: [
      "---",
      "+3 (3등급)",
      "+4 (4등급)",
      "+5 (5등급)",
      "+6 (6등급)",
      "+7 (7등급)",
    ],
  },
  {
    kind: ["방어력"],
    value: [
      "---",
      "+24 (3등급)",
      "+32 (4등급)",
      "+40 (5등급)",
      "+48 (6등급)",
      "+56 (7등급)",
    ],
  },
  {
    kind: ["이동속도", "점프력"],
    value: [
      "---",
      "+3 (3등급)",
      "+4 (4등급)",
      "+5 (5등급)",
      "+6 (6등급)",
      "+7 (7등급)",
    ],
  },
  {
    kind: ["올스탯 %"],
    value: [
      "---",
      "+3% (3등급)",
      "+4% (4등급)",
      "+5% (5등급)",
      "+6% (6등급)",
      "+7% (7등급)",
    ],
  },
  {
    kind: ["착용 레벨 감소"],
    value: [
      "---",
      "-15 (3등급)",
      "-20 (4등급)",
      "-25 (5등급)",
      "-30 (6등급)",
      "-35 (7등급)",
    ],
  },
];

export const ADD_OPTIONS_160_EQUIPMENT: AddOptions[] = [
  {
    kind: ["STR", "DEX", "INT", "LUK"],
    value: [
      "---",
      "+27 (3등급)",
      "+36 (4등급)",
      "+45 (5등급)",
      "+54 (6등급)",
      "+63 (7등급)",
    ],
  },
  {
    kind: [
      "STR + DEX",
      "STR + INT",
      "STR + LUK",
      "DEX + INT",
      "DEX + LUK",
      "INT + LUK",
    ],
    value: [
      "---",
      "+15 (3등급)",
      "+20 (4등급)",
      "+25 (5등급)",
      "+30 (6등급)",
      "+35 (7등급)",
    ],
  },
  {
    kind: ["최대 HP", "최대 MP"],
    value: [
      "---",
      "+1440 (3등급)",
      "+1920 (4등급)",
      "+2400 (5등급)",
      "+2880 (6등급)",
      "+3360 (7등급)",
    ],
  },
  {
    kind: ["공격력", "마력"],
    value: [
      "---",
      "+3 (3등급)",
      "+4 (4등급)",
      "+5 (5등급)",
      "+6 (6등급)",
      "+7 (7등급)",
    ],
  },
  {
    kind: ["방어력"],
    value: [
      "---",
      "+27 (3등급)",
      "+36 (4등급)",
      "+45 (5등급)",
      "+54 (6등급)",
      "+63 (7등급)",
    ],
  },
  {
    kind: ["이동속도", "점프력"],
    value: [
      "---",
      "+3 (3등급)",
      "+4 (4등급)",
      "+5 (5등급)",
      "+6 (6등급)",
      "+7 (7등급)",
    ],
  },
  {
    kind: ["올스탯 %"],
    value: [
      "---",
      "+3% (3등급)",
      "+4% (4등급)",
      "+5% (5등급)",
      "+6% (6등급)",
      "+7% (7등급)",
    ],
  },
  {
    kind: ["착용 레벨 감소"],
    value: [
      "---",
      "-15 (3등급)",
      "-20 (4등급)",
      "-25 (5등급)",
      "-30 (6등급)",
      "-35 (7등급)",
    ],
  },
];

export const ADD_OPTIONS_200_EQUIPMENT: AddOptions[] = [
  {
    kind: ["STR", "DEX", "INT", "LUK"],
    value: [
      "---",
      "+33 (3등급)",
      "+44 (4등급)",
      "+55 (5등급)",
      "+66 (6등급)",
      "+77 (7등급)",
    ],
  },
  {
    kind: [
      "STR + DEX",
      "STR + INT",
      "STR + LUK",
      "DEX + INT",
      "DEX + LUK",
      "INT + LUK",
    ],
    value: [
      "---",
      "+18 (3등급)",
      "+24 (4등급)",
      "+30 (5등급)",
      "+36 (6등급)",
      "+42 (7등급)",
    ],
  },
  {
    kind: ["최대 HP", "최대 MP"],
    value: [
      "---",
      "+1800 (3등급)",
      "+2400 (4등급)",
      "+3000 (5등급)",
      "+3600 (6등급)",
      "+4200 (7등급)",
    ],
  },
  {
    kind: ["공격력", "마력"],
    value: [
      "---",
      "+3 (3등급)",
      "+4 (4등급)",
      "+5 (5등급)",
      "+6 (6등급)",
      "+7 (7등급)",
    ],
  },
  {
    kind: ["방어력"],
    value: [
      "---",
      "+33 (3등급)",
      "+44 (4등급)",
      "+55 (5등급)",
      "+66 (6등급)",
      "+77 (7등급)",
    ],
  },
  {
    kind: ["이동속도", "점프력"],
    value: [
      "---",
      "+3 (3등급)",
      "+4 (4등급)",
      "+5 (5등급)",
      "+6 (6등급)",
      "+7 (7등급)",
    ],
  },
  {
    kind: ["올스탯 %"],
    value: [
      "---",
      "+3% (3등급)",
      "+4% (4등급)",
      "+5% (5등급)",
      "+6% (6등급)",
      "+7% (7등급)",
    ],
  },
  {
    kind: ["착용 레벨 감소"],
    value: [
      "---",
      "-15 (3등급)",
      "-20 (4등급)",
      "-25 (5등급)",
      "-30 (6등급)",
      "-35 (7등급)",
    ],
  },
];

export const ADD_OPTIONS_250_EQUIPMENT: AddOptions[] = [
  {
    kind: ["STR", "DEX", "INT", "LUK"],
    value: [
      "---",
      "+36 (3등급)",
      "+48 (4등급)",
      "+60 (5등급)",
      "+72 (6등급)",
      "+84 (7등급)",
    ],
  },
  {
    kind: [
      "STR + DEX",
      "STR + INT",
      "STR + LUK",
      "DEX + INT",
      "DEX + LUK",
      "INT + LUK",
    ],
    value: [
      "---",
      "+21 (3등급)",
      "+28 (4등급)",
      "+35 (5등급)",
      "+42 (6등급)",
      "+49 (7등급)",
    ],
  },
  {
    kind: ["최대 HP", "최대 MP"],
    value: [
      "---",
      "+2100 (3등급)",
      "+2800 (4등급)",
      "+3500 (5등급)",
      "+4200 (6등급)",
      "+4900 (7등급)",
    ],
  },
  {
    kind: ["공격력", "마력"],
    value: [
      "---",
      "+3 (3등급)",
      "+4 (4등급)",
      "+5 (5등급)",
      "+6 (6등급)",
      "+7 (7등급)",
    ],
  },
  {
    kind: ["방어력"],
    value: [
      "---",
      "+36 (3등급)",
      "+48 (4등급)",
      "+60 (5등급)",
      "+72 (6등급)",
      "+84 (7등급)",
    ],
  },
  {
    kind: ["이동속도", "점프력"],
    value: [
      "---",
      "+3 (3등급)",
      "+4 (4등급)",
      "+5 (5등급)",
      "+6 (6등급)",
      "+7 (7등급)",
    ],
  },
  {
    kind: ["올스탯 %"],
    value: [
      "---",
      "+3% (3등급)",
      "+4% (4등급)",
      "+5% (5등급)",
      "+6% (6등급)",
      "+7% (7등급)",
    ],
  },
  {
    kind: ["착용 레벨 감소"],
    value: [
      "---",
      "-15 (3등급)",
      "-20 (4등급)",
      "-25 (5등급)",
      "-30 (6등급)",
      "-35 (7등급)",
    ],
  },
];

export const ADD_OPTIONS_WEAPON: AddOptions[] = [
  {
    kind: ["보스 몬스터 공격 시 데미지 %"],
    value: [
      "---",
      "+2% (1등급)",
      "+4% (2등급)",
      "+6% (3등급)",
      "+8% (4등급)",
      "+10% (5등급)",
      "+12% (6등급)",
      "+14% (7등급)",
    ],
  },
  {
    kind: ["데미지 %"],
    value: [
      "---",
      "+1% (1등급)",
      "+2% (2등급)",
      "+3% (3등급)",
      "+4% (4등급)",
      "+5% (5등급)",
      "+6% (6등급)",
      "+7% (7등급)",
    ],
  },
];
